general/english/en_phrase.org
#+SETUPFILE: ../../styles/readtheorg.setup
#+TITLE: English Phrase

* A
** all the more

*expr.adv.* \\
even more \\
notably, but even more notably due to additional information
: Lytle's progress as a boxer is [ all the more ] remarkable when taking into account his unique circumstances.‎

** as yet

*expr.adv.* \\
[ so far | till now | up to now ] \\
to describe a situation that has existed [ up to this point | up to the present time ] \\
(used in negative statement)
: [ As yet ] only a handful of European countries allow some form of doctor-assisted dying.
: How this might ... is, [ as yet ], unclear.

* C
** come by

*expr.vt.* \\
to [ get | find ] \\
to manage to [ acquire | obtain ]

* G
** get by

*expr.v.* \\
to cope, to survive \\
to manage with difficulty to live or accomplish sth.
: He had just enough money to [ get by ].

* M
** make of

*expr.vt.* \\
to [ interpret | perceive ] \\
to understand sb. or the meaning of sth. in a particular way
: What do you [ make of ] this news?
: I don't know what to [ make of ] our new teacher.

** much less

*expr.* \\
to introduce sth. as being even less likely or suitable than sth. else already mentioned
: What woman would consider a date with him, [ much less ] a marriage?

* R
** rule out

*expr.vt.* \\
to [ exclude | eliminate ]

* S
** set off

*expr.v.* \\
to begin a journey \\
: They [ set off ] for America with nothing but the clothes on their backs.
: If you just [ set off ] in one direction, running as fast as you can, you are not likely to succeed.
