general/english/en_phrase.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-20 Tue 14:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>English Phrase</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Victor Chen" />
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>
</head>
<body>
<div id="content">
<h1 class="title">English Phrase</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org25ea07b">1 A</a>
<ul>
<li><a href="#org8bb1b27">1.1 all the more</a></li>
<li><a href="#org0e0839a">1.2 as yet</a></li>
</ul>
</li>
<li><a href="#org33d9f6c">2 C</a>
<ul>
<li><a href="#org5e17b19">2.1 come by</a></li>
</ul>
</li>
<li><a href="#org7bea60a">3 G</a>
<ul>
<li><a href="#org5ac61c2">3.1 get by</a></li>
</ul>
</li>
<li><a href="#org63e38bf">4 M</a>
<ul>
<li><a href="#org364ce3a">4.1 make of</a></li>
<li><a href="#org05c15a0">4.2 much less</a></li>
</ul>
</li>
<li><a href="#org637537f">5 R</a>
<ul>
<li><a href="#org620f4f4">5.1 rule out</a></li>
</ul>
</li>
<li><a href="#orgbc8a9f4">6 S</a>
<ul>
<li><a href="#orgf3cc4f2">6.1 set off</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org25ea07b" class="outline-2">
<h2 id="org25ea07b"><span class="section-number-2">1</span> A</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org8bb1b27" class="outline-3">
<h3 id="org8bb1b27"><span class="section-number-3">1.1</span> all the more</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>expr.adv.</b> <br />
even more <br />
notably, but even more notably due to additional information
</p>
<pre class="example">
Lytle's progress as a boxer is [ all the more ] remarkable when taking into account his unique circumstances.‎

</pre>
</div>
</div>

<div id="outline-container-org0e0839a" class="outline-3">
<h3 id="org0e0839a"><span class="section-number-3">1.2</span> as yet</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<b>expr.adv.</b> <br />
[ so far | till now | up to now ] <br />
to describe a situation that has existed [ up to this point | up to the present time ] <br />
(used in negative statement)
</p>
<pre class="example">
[ As yet ] only a handful of European countries allow some form of doctor-assisted dying.
How this might ... is, [ as yet ], unclear.

</pre>
</div>
</div>
</div>

<div id="outline-container-org33d9f6c" class="outline-2">
<h2 id="org33d9f6c"><span class="section-number-2">2</span> C</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org5e17b19" class="outline-3">
<h3 id="org5e17b19"><span class="section-number-3">2.1</span> come by</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<b>expr.vt.</b> <br />
to [ get | find ] <br />
to manage to [ acquire | obtain ]
</p>
</div>
</div>
</div>

<div id="outline-container-org7bea60a" class="outline-2">
<h2 id="org7bea60a"><span class="section-number-2">3</span> G</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-org5ac61c2" class="outline-3">
<h3 id="org5ac61c2"><span class="section-number-3">3.1</span> get by</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<b>expr.v.</b> <br />
to cope, to survive <br />
to manage with difficulty to live or accomplish sth.
</p>
<pre class="example">
He had just enough money to [ get by ].

</pre>
</div>
</div>
</div>

<div id="outline-container-org63e38bf" class="outline-2">
<h2 id="org63e38bf"><span class="section-number-2">4</span> M</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-org364ce3a" class="outline-3">
<h3 id="org364ce3a"><span class="section-number-3">4.1</span> make of</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<b>expr.vt.</b> <br />
to [ interpret | perceive ] <br />
to understand sb. or the meaning of sth. in a particular way
</p>
<pre class="example">
What do you [ make of ] this news?
I don't know what to [ make of ] our new teacher.

</pre>
</div>
</div>

<div id="outline-container-org05c15a0" class="outline-3">
<h3 id="org05c15a0"><span class="section-number-3">4.2</span> much less</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<b>expr.</b> <br />
to introduce sth. as being even less likely or suitable than sth. else already mentioned
</p>
<pre class="example">
What woman would consider a date with him, [ much less ] a marriage?

</pre>
</div>
</div>
</div>

<div id="outline-container-org637537f" class="outline-2">
<h2 id="org637537f"><span class="section-number-2">5</span> R</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-org620f4f4" class="outline-3">
<h3 id="org620f4f4"><span class="section-number-3">5.1</span> rule out</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<b>expr.vt.</b> <br />
to [ exclude | eliminate ]
</p>
</div>
</div>
</div>

<div id="outline-container-orgbc8a9f4" class="outline-2">
<h2 id="orgbc8a9f4"><span class="section-number-2">6</span> S</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-orgf3cc4f2" class="outline-3">
<h3 id="orgf3cc4f2"><span class="section-number-3">6.1</span> set off</h3>
<div class="outline-text-3" id="text-6-1">
<p>
<b>expr.v.</b> <br />
to begin a journey <br />
</p>
<pre class="example">
They [ set off ] for America with nothing but the clothes on their backs.
If you just [ set off ] in one direction, running as fast as you can, you are not likely to succeed.

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Victor Chen</p>
<p class="date">Created: 2019-08-20 Tue 14:59</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
